atuslhc/band/rockband0/MCU Firmware/I4S/os/FreeRTOS/portable/LowPower/lowpower_efm32.c
/*
 * lowpower_efm32.c
 *
 *  Created on: 2013-6-13
 *      Author: Administrator
 */
#include <stdbool.h>
#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_device.h"
#include "core_cm4.h"
#include "core_cmFunc.h"

#include "efm32.h"
#include "em_rtc.h"
#include "em_emu.h"
#include "em_cmu.h"

#include "bsp.h"

#if defined(__ICCARM__)
#define __WEAK __weak
#elif defined(__GNUC__)
#define __WEAK __attribute__(( weak ))
#endif


#if (configUSE_TICKLESS_IDLE == 1) || (configUSE_TICKLESS_IDLE == 2)
#ifndef configSYSTICK_CLOCK_HZ
#define configSYSTICK_CLOCK_HZ configCPU_CLOCK_HZ
#endif
#endif


#define configRTCTICK_CLOCK_HZ          (32768)
#define configRTC_GET_COUNT()			RTC_CounterGet()
#define configRTC_RESET_COUNT()			RTC_CounterReset()
#define configRTC_SET_COMPARE(x)		RTC_CompareSet(0,(x))
#define configRTC_CNT_MASK              _RTC_CNT_MASK
#define configRTC_ENABLE()				RTC_Enable(true)
#define configRTC_DISABLE()             RTC_Enable(false)
#define configSLEEP_PROCESSING()        EMU_EnterEM2(true)

#define OSTICK_TO_RTCTICK(x)  (configRTCTICK_CLOCK_HZ*(x)/configTICK_RATE_HZ)
#define RTCTICK_TO_OSTICK(x)  (configTICK_RATE_HZ*(x)/configRTCTICK_CLOCK_HZ)
#define RTCTICK_TO_SYSTICK(x) (configSYSTICK_CLOCK_HZ*(x)/configRTCTICK_CLOCK_HZ)

/* Constants required to manipulate the core.  Registers first... */
#define portNVIC_SYSTICK_CTRL_REG			( * ( ( volatile unsigned long * ) 0xe000e010 ) )
#define portNVIC_SYSTICK_LOAD_REG			( * ( ( volatile unsigned long * ) 0xe000e014 ) )
#define portNVIC_SYSTICK_CURRENT_VALUE_REG	( * ( ( volatile unsigned long * ) 0xe000e018 ) )
#define portNVIC_INT_CTRL_REG				( * ( ( volatile unsigned long * ) 0xe000ed04 ) )
#define portNVIC_SYSPRI2_REG				( * ( ( volatile unsigned long * ) 0xe000ed20 ) )
/* ...then bits in the registers. */
#define portNVIC_SYSTICK_CLK_BIT			( 1UL << 2UL )
#define portNVIC_SYSTICK_INT_BIT			( 1UL << 1UL )
#define portNVIC_SYSTICK_ENABLE_BIT			( 1UL << 0UL )
#define portNVIC_SYSTICK_COUNT_FLAG_BIT		( 1UL << 16UL )
#define portNVIC_PENDSVSET_BIT				( 1UL << 28UL )
#define portNVIC_PENDSVCLEAR_BIT 			( 1UL << 27UL )
#define portNVIC_PEND_SYSTICK_CLEAR_BIT		( 1UL << 25UL )


/*-----------------------------------------------------------*/
/*
 * The number of SysTick increments that make up one tick period.
 */
#if configUSE_TICKLESS_IDLE == 1 || configUSE_TICKLESS_IDLE == 2 || configUSE_TICKLESS_IDLE == 3 || configUSE_TICKLESS_IDLE == 4
static unsigned long ulTimerReloadValueForOneTick = 0;
#endif

/*
 * The maximum number of tick periods that can be suppressed is limited by the
 * 24 bit resolution of the SysTick timer.
 */
#if configUSE_TICKLESS_IDLE == 1 || configUSE_TICKLESS_IDLE == 2 || configUSE_TICKLESS_IDLE == 3 || configUSE_TICKLESS_IDLE == 4
static unsigned long xMaximumPossibleSuppressedTicks = 0;
#endif /* configUSE_TICKLESS_IDLE */

/*
 * Compensate for the CPU cycles that pass while the SysTick is stopped (low
 * power functionality only.
 */
#if configUSE_TICKLESS_IDLE == 1 || configUSE_TICKLESS_IDLE == 2 || configUSE_TICKLESS_IDLE == 3 || configUSE_TICKLESS_IDLE == 4
static unsigned long ulStoppedTimerCompensation = 0;
#endif /* configUSE_TICKLESS_IDLE */



/*-----------------------------------------------------------*/
/*-----------------------------------------------------------*/
#if configUSE_TICKLESS_IDLE == 1
__WEAK void vPortSuppressTicksAndSleep( portTickType xExpectedIdleTime )
{
    unsigned long ulReloadValue, ulCompleteTickPeriods, ulCompletedSysTickIncrements;
    portTickType xModifiableIdleTime;


    /* Make sure the SysTick reload value does not overflow the counter. */
    if( xExpectedIdleTime > xMaximumPossibleSuppressedTicks )
    {
        xExpectedIdleTime = xMaximumPossibleSuppressedTicks;
    }

    /* Calculate the reload value required to wait xExpectedIdleTime
    tick periods.  -1 is used because this code will execute part way
    through one of the tick periods, and the fraction of a tick period is
    accounted for later. */
    ulReloadValue = ( ulTimerReloadValueForOneTick * ( xExpectedIdleTime - 1UL ) );
    if( ulReloadValue > ulStoppedTimerCompensation )
    {
        ulReloadValue -= ulStoppedTimerCompensation;
    }

    /* Stop the SysTick momentarily.  The time the SysTick is stopped for
    is accounted for as best it can be, but using the tickless mode will
    inevitably result in some tiny drift of the time maintained by the
    kernel with respect to calendar time. */
    portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT;

    /* Adjust the reload value to take into account that the current time
    slice is already partially complete. */
    ulReloadValue += ( portNVIC_SYSTICK_LOAD_REG - ( portNVIC_SYSTICK_LOAD_REG - portNVIC_SYSTICK_CURRENT_VALUE_REG ) );

    /* Enter a critical section but don't use the taskENTER_CRITICAL()
    method as that will mask interrupts that should exit sleep mode. */
    __disable_irq();

    /* If a context switch is pending or a task is waiting for the scheduler
    to be unsuspended then abandon the low power entry. */
    if( eTaskConfirmSleepModeStatus() == eAbortSleep )
    {
        /* Restart SysTick. */
        portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT;

        /* Re-enable interrupts - see comments above the cpsid instruction()
        above. */
        __enable_irq();
    }
    else
    {
        /* Set the new reload value. */
        portNVIC_SYSTICK_LOAD_REG = ulReloadValue;

        /* Clear the SysTick count flag and set the count value back to
        zero. */
        portNVIC_SYSTICK_CURRENT_VALUE_REG = 0UL;

        /* Restart SysTick. */
        portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT;

        /* Sleep until something happens.  configPRE_SLEEP_PROCESSING() can
        set its parameter to 0 to indicate that its implementation contains
        its own wait for interrupt or wait for event instruction, and so wfi
        should not be executed again.  However, the original expected idle
        time variable must remain unmodified, so a copy is taken. */
        xModifiableIdleTime = xExpectedIdleTime;
        configPRE_SLEEP_PROCESSING( xModifiableIdleTime );
        if( xModifiableIdleTime > 0 )
        {
            __asm volatile( "wfi" );
        }
        configPOST_SLEEP_PROCESSING( xExpectedIdleTime );

        /* Stop SysTick.  Again, the time the SysTick is stopped for is
        accounted for as best it can be, but using the tickless mode will
        inevitably result in some tiny drift of the time maintained by the
        kernel with respect to calendar time. */
        portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT;

        /* Re-enable interrupts - see comments above the cpsid instruction()
        above. */
        __enable_irq();

        if( ( portNVIC_SYSTICK_CTRL_REG & portNVIC_SYSTICK_COUNT_FLAG_BIT ) != 0 )
        {
            /* The tick interrupt has already executed, and the SysTick
            count reloaded with the portNVIC_SYSTICK_LOAD_REG value.
            Reset the portNVIC_SYSTICK_LOAD_REG with whatever remains of
            this tick period. */
            portNVIC_SYSTICK_LOAD_REG = ulTimerReloadValueForOneTick - ( ulReloadValue - portNVIC_SYSTICK_CURRENT_VALUE_REG );

