atuslhc/band/rockband0/MCU Firmware/I4S/os/FreeRTOS/portable/LowPower/lowpower_efm32.c
            /* The tick interrupt handler will already have pended the tick
            processing in the kernel.  As the pending tick will be
            processed as soon as this function exits, the tick value
            maintained by the tick is stepped forward by one less than the
            time spent waiting. */
            ulCompleteTickPeriods = xExpectedIdleTime - 1UL;
        }
        else
        {
            /* Something other than the tick interrupt ended the sleep.
            Work out how long the sleep lasted. */
            ulCompletedSysTickIncrements = ( xExpectedIdleTime * ulTimerReloadValueForOneTick ) - portNVIC_SYSTICK_CURRENT_VALUE_REG;

            /* How many complete tick periods passed while the processor
            was waiting? */
            ulCompleteTickPeriods = ulCompletedSysTickIncrements / ulTimerReloadValueForOneTick;

            /* The reload value is set to whatever fraction of a single tick
            period remains. */
            portNVIC_SYSTICK_LOAD_REG = ( ( ulCompleteTickPeriods + 1 ) * ulTimerReloadValueForOneTick ) - ulCompletedSysTickIncrements;
        }

        /* Restart SysTick so it runs from portNVIC_SYSTICK_LOAD_REG
        again, then set portNVIC_SYSTICK_LOAD_REG back to its standard
        value. */
        portNVIC_SYSTICK_CURRENT_VALUE_REG = 0UL;
        portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT;

        vTaskStepTick( ulCompleteTickPeriods );
    }
}
#endif /* #if configUSE_TICKLESS_IDLE */
#if configUSE_TICKLESS_IDLE == 2
void OS_RTC_TickInit (void);
void OS_RTC_TickSetup(uint32_t tick);

__WEAK void vPortSuppressTicksAndSleep( portTickType xExpectedIdleTime )
{
    unsigned long ulReloadValue, ulRTCCurCnt, ulRTCStoreCnt, ulCompleteTickPeriods, ulRTCTickPeriods;
    portTickType xModifiableIdleTime;

    if( xExpectedIdleTime > xMaximumPossibleSuppressedTicks )
    {
        xExpectedIdleTime = xMaximumPossibleSuppressedTicks;
    }

    /* Calculate the reload value required to wait xExpectedIdleTime
    tick periods.  -1 is used because this code will execute part way
    through one of the tick periods, and the fraction of a tick period is
    accounted for later. */
    ulReloadValue = OSTICK_TO_RTCTICK( xExpectedIdleTime - 1);
    if( ulReloadValue > ulStoppedTimerCompensation )
    {
        ulReloadValue -= ulStoppedTimerCompensation;
    }


    __disable_irq();

    /* If a context switch is pending or a task is waiting for the scheduler
     to be unsuspended then abandon the low power entry. */
    if( eTaskConfirmSleepModeStatus() == eAbortSleep )
    {
        /* Re-enable interrupts - see comments above the cpsid instruction()
        above. */
        __enable_irq();
    }
    else
    {

        portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT;

        ulRTCCurCnt = 0;
        ulRTCStoreCnt = ulRTCCurCnt;
        ulReloadValue += ulRTCCurCnt;

        /* Set the new reload value. */
        configRTC_RESET_COUNT();
        configRTC_SET_COMPARE(ulReloadValue);
        configRTC_ENABLE();



        /* Sleep until something happens.  configPRE_SLEEP_PROCESSING() can
         set its parameter to 0 to indicate that its implementation contains
         its own wait for interrupt or wait for event instruction, and so wfi
         should not be executed again.  However, the original expected idle
         time variable must remain unmodified, so a copy is taken. */
        xModifiableIdleTime = xExpectedIdleTime;
        configPRE_SLEEP_PROCESSING( xModifiableIdleTime );
        if( xModifiableIdleTime > 0 )
        {
            configSLEEP_PROCESSING();
        }
        configPOST_SLEEP_PROCESSING( xExpectedIdleTime );


        ulRTCCurCnt = configRTC_GET_COUNT();
        configRTC_DISABLE();
        if( ulRTCCurCnt >= ulReloadValue)
        {
            /* The tick interrupt has already executed, and the SysTick
             count reloaded with the portNVIC_SYSTICK_LOAD_REG value.
             Reset the portNVIC_SYSTICK_LOAD_REG with whatever remains of
             this tick period. */

            /* The tick interrupt handler will already have pended the tick
             processing in the kernel.  As the pending tick will be
             processed as soon as this function exits, the tick value
             maintained by the tick is stepped forward by one less than the
             time spent waiting. */
            ulCompleteTickPeriods = xExpectedIdleTime;
        }
        else
        {
            /* Something other than the tick interrupt ended the sleep.
             Work out how long the sleep lasted. */
            ulRTCTickPeriods  = (ulRTCCurCnt - ulRTCStoreCnt)&configRTC_CNT_MASK;
            ulCompleteTickPeriods = RTCTICK_TO_OSTICK(ulRTCTickPeriods);


        }

        portNVIC_SYSTICK_LOAD_REG = ulTimerReloadValueForOneTick -
                                    (RTCTICK_TO_SYSTICK((ulRTCCurCnt - ulRTCStoreCnt)&configRTC_CNT_MASK) -
                                     portNVIC_SYSTICK_LOAD_REG + portNVIC_SYSTICK_CURRENT_VALUE_REG) %
                                    ulTimerReloadValueForOneTick;
        portNVIC_SYSTICK_CURRENT_VALUE_REG = 0UL;
        portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT;
        /* Restart SysTick so it runs from portNVIC_SYSTICK_LOAD_REG
         again, then set portNVIC_SYSTICK_LOAD_REG back to its standard
         value. */
        vTaskStepTick( ulCompleteTickPeriods );
        __enable_irq();
    }
}
#endif

#if configUSE_TICKLESS_IDLE == 3
void  OS_RTC_TickInit (void);
void  OS_RTC_TickSetup(uint32_t tick);

bool IsSafeToEnterEM2(void)
{
    extern bool USBD_SafeToEnterEM2(void);
    return USBD_SafeToEnterEM2();
}

__WEAK void vPortSuppressTicksAndSleep( portTickType xExpectedIdleTime )
{
    unsigned long ulReloadValue, ulRTCTickPeriods, ulRTCCurCnt, ulRTCStoreCnt, ulCompleteTickPeriods;
    portTickType xModifiableIdleTime;

