atuslhc/band/rockband0/MCU Firmware/I4S/os/FreeRTOS/portable/LowPower/lowpower_efm32.c
    if( xExpectedIdleTime > xMaximumPossibleSuppressedTicks )
    {
        xExpectedIdleTime = xMaximumPossibleSuppressedTicks;
    }

    ulReloadValue = OSTICK_TO_RTCTICK(xExpectedIdleTime);
    if( ulReloadValue > ulStoppedTimerCompensation )
    {
        ulReloadValue -= ulStoppedTimerCompensation;
    }

    /* Enter a critical section but don't use the taskENTER_CRITICAL()
    method as that will mask interrupts that should exit sleep mode. */
    //__disable_interrupt();
    __disable_irq();

    /* If a context switch is pending or a task is waiting for the scheduler
    to be unsuspended then abandon the low power entry. */
    if( eTaskConfirmSleepModeStatus() == eAbortSleep || !IsSafeToEnterEM2())
    {
        __enable_irq();
        return;
    }
    else
    {
        ulRTCCurCnt = configRTC_GET_COUNT();
        ulRTCStoreCnt = ulRTCCurCnt;

        ulReloadValue = OSTICK_TO_RTCTICK(
                            RTCTICK_TO_OSTICK(ulRTCCurCnt) + xExpectedIdleTime);

        if(ulReloadValue > configRTCTICK_CLOCK_HZ)
        {
            ulReloadValue = configRTCTICK_CLOCK_HZ;
        }

        configRTC_SET_COMPARE(ulReloadValue);



        /* Sleep until something happens.  configPRE_SLEEP_PROCESSING() can
        set its parameter to 0 to indicate that its implementation contains
        its own wait for interrupt or wait for event instruction, and so wfi
        should not be executed again.  However, the original expected idle
        time variable must remain unmodified, so a copy is taken. */
        xModifiableIdleTime = xExpectedIdleTime;
        configPRE_SLEEP_PROCESSING( xModifiableIdleTime );
        if( xModifiableIdleTime > 0 )
        {

            if (GetSysEnergyModeFlag() == 0)
            {
                EMU_EnterEM2(true);
            }
            else
            {
                EMU_EnterEM1();//DMA Not Done

                ulRTCCurCnt = configRTC_GET_COUNT();
                if( ((ulRTCCurCnt - ulRTCStoreCnt)&configRTC_CNT_MASK ) <
                        ulReloadValue)
                {
                    EMU_EnterEM2(true);
                }
            }
        }
        configPOST_SLEEP_PROCESSING( xExpectedIdleTime );

        ulRTCCurCnt = configRTC_GET_COUNT();

        if(ulRTCCurCnt > ulRTCStoreCnt)
        {
            ulRTCTickPeriods = ulRTCCurCnt - ulRTCStoreCnt;
        }
        else
        {
            ulRTCTickPeriods = configRTCTICK_CLOCK_HZ + ulRTCCurCnt - ulRTCStoreCnt;
        }

        ulCompleteTickPeriods = RTCTICK_TO_OSTICK(ulRTCTickPeriods);
        if(ulRTCTickPeriods >= configRTCTICK_CLOCK_HZ)
        {
            ulRTCTickPeriods = OSTICK_TO_RTCTICK(1);
        }
        else
        {
            ulRTCTickPeriods = OSTICK_TO_RTCTICK(ulCompleteTickPeriods + 1);
        }

        configRTC_SET_COMPARE(ulRTCTickPeriods);

        /* Restart SysTick so it runs from portNVIC_SYSTICK_LOAD_REG
        again, then set portNVIC_SYSTICK_LOAD_REG back to its standard
        value. */
        vTaskStepTick( ulCompleteTickPeriods - 1);
        __enable_irq();


        ( void ) portSET_INTERRUPT_MASK_FROM_ISR();
        {
            vTaskIncrementTick();
        }
        portCLEAR_INTERRUPT_MASK_FROM_ISR( 0 );

#if configUSE_PREEMPTION == 1
        portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;
#endif
    }
}
#endif

#if configUSE_TICKLESS_IDLE == 4
void  OS_RTC_TickInit (void);
void  OS_RTC_TickSetup(uint32_t tick);

bool IsSafeToEnterEM2(void)
{
    extern bool USBD_SafeToEnterEM2(void);
    return USBD_SafeToEnterEM2();
}

__WEAK void vPortSuppressTicksAndSleep( portTickType xExpectedIdleTime )
{
    unsigned long ulReloadValue, ulRTCTickPeriods, ulRTCCurCnt, ulRTCStoreCnt, ulCompleteTickPeriods;
    portTickType xModifiableIdleTime;

    if( xExpectedIdleTime > xMaximumPossibleSuppressedTicks )
    {
        xExpectedIdleTime = xMaximumPossibleSuppressedTicks;
    }

    ulReloadValue = OSTICK_TO_RTCTICK(xExpectedIdleTime);
    if( ulReloadValue > ulStoppedTimerCompensation )
    {
        ulReloadValue -= ulStoppedTimerCompensation;
    }

    /* Enter a critical section but don't use the taskENTER_CRITICAL()
    method as that will mask interrupts that should exit sleep mode. */
    //__disable_interrupt();
    __disable_irq();

    /* If a context switch is pending or a task is waiting for the scheduler
    to be unsuspended then abandon the low power entry. */
    if( eTaskConfirmSleepModeStatus() == eAbortSleep || !IsSafeToEnterEM2())
    {
        __enable_irq();
        return;
    }
    else
    {
        ulRTCCurCnt = configRTC_GET_COUNT();
        configRTC_SET_COMPARE((ulReloadValue + ulRTCCurCnt)&configRTC_CNT_MASK);

        ulRTCStoreCnt = ulRTCCurCnt;




        /* Sleep until something happens.  configPRE_SLEEP_PROCESSING() can
        set its parameter to 0 to indicate that its implementation contains
        its own wait for interrupt or wait for event instruction, and so wfi
        should not be executed again.  However, the original expected idle
        time variable must remain unmodified, so a copy is taken. */
        xModifiableIdleTime = xExpectedIdleTime;
        configPRE_SLEEP_PROCESSING( xModifiableIdleTime );
        if( xModifiableIdleTime > 0 )
        {

            if (GetSysEnergyModeFlag() == 0)
            {
                EMU_EnterEM2(true);
            }
            else
            {
                EMU_EnterEM1();//DMA Not Done

                ulRTCCurCnt = configRTC_GET_COUNT();
                if( ((ulRTCCurCnt - ulRTCStoreCnt)&configRTC_CNT_MASK ) <
                        ulReloadValue)
                {
                    if (GetSysEnergyModeFlag() == 0)  //EM1 wakeup but not clear(timer example)
                    {
                        EMU_EnterEM2(true);
                    }
                }
            }
        }
        configPOST_SLEEP_PROCESSING( xExpectedIdleTime );

        ulRTCCurCnt = configRTC_GET_COUNT();
        if( ((ulRTCCurCnt - ulRTCStoreCnt)&configRTC_CNT_MASK ) >=
                ulReloadValue)
        {
            /* The tick interrupt has already executed, and the SysTick
            count reloaded with the portNVIC_SYSTICK_LOAD_REG value.
            Reset the portNVIC_SYSTICK_LOAD_REG with whatever remains of
            this tick period. */


