atuslhc/band/rockband0/MCU Firmware/I4S/os/FreeRTOS/portable/LowPower/lowpower_efm32.c
            /* The tick interrupt handler will already have pended the tick
            processing in the kernel.  As the pending tick will be
            processed as soon as this function exits, the tick value
            maintained by the tick is stepped forward by one less than the
            time spent waiting. */
            ulCompleteTickPeriods = (xExpectedIdleTime);
        }
        else
        {
            ulRTCTickPeriods  = (ulRTCCurCnt - ulRTCStoreCnt)&configRTC_CNT_MASK;
            ulCompleteTickPeriods = RTCTICK_TO_OSTICK(ulRTCTickPeriods);
        }

        configRTC_RESET_COUNT();
        configRTC_SET_COMPARE(ulTimerReloadValueForOneTick -
                              ulRTCCurCnt % ulTimerReloadValueForOneTick);
        RTC_IntClear(RTC_IFC_COMP0);
        NVIC_ClearPendingIRQ(RTC_IRQn);

        /* Restart SysTick so it runs from portNVIC_SYSTICK_LOAD_REG
        again, then set portNVIC_SYSTICK_LOAD_REG back to its standard
        value. */
        if(ulCompleteTickPeriods >= 2){
          vTaskStepTick( ulCompleteTickPeriods - 1);
        }
        __enable_irq();

        ( void ) portSET_INTERRUPT_MASK_FROM_ISR();
        {
          if(ulCompleteTickPeriods >= 1){
            vTaskIncrementTick();
          }
        }
        portCLEAR_INTERRUPT_MASK_FROM_ISR( 0 );

#if configUSE_PREEMPTION == 1
        portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;
#endif
    }
}
#endif


/*-----------------------------------------------------------*/

void xPortSysTickHandler( void )
{
    /* If using preemption, also force a context switch. */
#if configUSE_PREEMPTION == 1
    portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;
#endif

    /* Only reset the systick load register if configUSE_TICKLESS_IDLE is set to
    1.  If it is set to 0 tickless idle is not being used.  If it is set to a
    value other than 0 or 1 then a timer other than the SysTick is being used
    to generate the tick interrupt. */
#if configUSE_TICKLESS_IDLE == 1 || configUSE_TICKLESS_IDLE == 2
    portNVIC_SYSTICK_LOAD_REG = ulTimerReloadValueForOneTick;
#endif

    ( void ) portSET_INTERRUPT_MASK_FROM_ISR();
    {
        vTaskIncrementTick();
    }
    portCLEAR_INTERRUPT_MASK_FROM_ISR( 0 );
}

/*
 * Setup the systick timer to generate the tick interrupts at the required
 * frequency.
 */
__WEAK void vPortSetupTimerInterrupt( void )
{

    /* Calculate the constants required to configure the tick interrupt. */
#if (configUSE_TICKLESS_IDLE == 1)
    {
        ulTimerReloadValueForOneTick = ( configSYSTICK_CLOCK_HZ / configTICK_RATE_HZ ) - 1UL;
        xMaximumPossibleSuppressedTicks = 0xffffffUL / ( ( configSYSTICK_CLOCK_HZ / configTICK_RATE_HZ ) - 1UL );
        ulStoppedTimerCompensation = 45UL / ( configCPU_CLOCK_HZ / configSYSTICK_CLOCK_HZ );
    }
#endif /* configUSE_TICKLESS_IDLE */

#if (configUSE_TICKLESS_IDLE == 2)
    {
        ulTimerReloadValueForOneTick = ( configSYSTICK_CLOCK_HZ / configTICK_RATE_HZ ) - 1UL;
        xMaximumPossibleSuppressedTicks = 0xffffffUL / ( ( configSYSTICK_CLOCK_HZ / configTICK_RATE_HZ ) - 1UL );
        ulStoppedTimerCompensation = 0;
    }
#endif /* configUSE_TICKLESS_IDLE */
#if (configUSE_TICKLESS_IDLE == 3)
    {
        ulTimerReloadValueForOneTick = ( configRTCTICK_CLOCK_HZ / configTICK_RATE_HZ );
        xMaximumPossibleSuppressedTicks = 0xffffffUL / ( ( configRTCTICK_CLOCK_HZ / configTICK_RATE_HZ ) - 1UL ) - 1UL;
        ulStoppedTimerCompensation = 0;
    }
    OS_RTC_TickInit();
    OS_RTC_TickSetup(ulTimerReloadValueForOneTick);
#elif(configUSE_TICKLESS_IDLE == 4)
    {
        ulTimerReloadValueForOneTick = ( configRTCTICK_CLOCK_HZ / configTICK_RATE_HZ );
        xMaximumPossibleSuppressedTicks = 0xffffffUL / ( ( configRTCTICK_CLOCK_HZ / configTICK_RATE_HZ ) - 1UL ) - 1UL;
        ulStoppedTimerCompensation = 0;
    }
    OS_RTC_TickInit();
    OS_RTC_TickSetup(ulTimerReloadValueForOneTick);
#else
    /* Configure SysTick to interrupt at the requested rate. */
    portNVIC_SYSTICK_LOAD_REG = ( configSYSTICK_CLOCK_HZ / configTICK_RATE_HZ ) - 1UL;;
    portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT;
#endif

#if (configUSE_TICKLESS_IDLE == 2)
    OS_RTC_TickInit();
#endif
}





/*-----------------------------------------------------------*/

#if (configUSE_TICKLESS_IDLE == 2)||(configUSE_TICKLESS_IDLE == 3)||(configUSE_TICKLESS_IDLE == 3)
/*
 * Setup RTC Timer
 */
__WEAK void OS_RTC_TickInit (void)
{
    RTC_Init_TypeDef rtcInit = RTC_INIT_DEFAULT;
    /* Configuring clocks in the Clock Management Unit (CMU) */
    /* Starting LFRCO and waiting until it is stable */
    //CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true);

    /* Routing the LFXO clock to the RTC */
    //CMU_ClockSelectSet(cmuClock_LFA,cmuSelect_LFRCO);
    CMU_ClockSelectSet(cmuClock_LFA, cmuSelect_LFXO);
    CMU_ClockEnable(cmuClock_RTC, true);

    /* Enabling clock to the interface of the low energy modules */
    CMU_ClockEnable(cmuClock_CORELE, true);


    RTC_Init(&rtcInit);
    RTC_IntEnable(RTC_IF_COMP0 | RTC_IF_COMP1);
    RTC_CompareSet(0, configRTCTICK_CLOCK_HZ);

    /* Enabling Interrupt from RTC */
    NVIC_EnableIRQ(RTC_IRQn);
    NVIC_SetPriority(RTC_IRQn, 0);

    RTC_Enable(false);
}

__WEAK void OS_RTC_TickSetup(uint32_t tick)
{
    /* Setting up RTC */
    RTC_CompareSet(1, tick);

    /* Enabling the RTC */
    RTC_Enable(true);

}

#endif

#if (configUSE_TICKLESS_IDLE == 4)
/*
 * Setup RTC Timer
 */
__WEAK void OS_RTC_TickInit (void)
{
    RTC_Init_TypeDef rtcInit = RTC_INIT_DEFAULT;

    rtcInit.comp0Top = false;
    /* Configuring clocks in the Clock Management Unit (CMU) */
    /* Starting LFRCO and waiting until it is stable */
    //CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true);

    /* Routing the LFXO clock to the RTC */
    //CMU_ClockSelectSet(cmuClock_LFA,cmuSelect_LFRCO);
    CMU_ClockSelectSet(cmuClock_LFA, cmuSelect_LFXO);
    CMU_ClockEnable(cmuClock_RTC, true);

    /* Enabling clock to the interface of the low energy modules */
    CMU_ClockEnable(cmuClock_CORELE, true);


