atuslhc/band/rockband0/MCU Firmware/I4S/os/FreeRTOS/portable/LowPower/lowpower_efm32.c
    RTC_Init(&rtcInit);
    RTC_IntEnable(RTC_IF_COMP0);

    /* Enabling Interrupt from RTC */
    NVIC_EnableIRQ(RTC_IRQn);
    NVIC_SetPriority(RTC_IRQn, 0);

    RTC_Enable(false);
}

__WEAK void OS_RTC_TickSetup(uint32_t tick)
{
    /* Setting up RTC */
    RTC_CompareSet(0, tick);

    /* Enabling the RTC */
    RTC_Enable(true);
}

#endif

#if (configUSE_TICKLESS_IDLE == 2)
void xPortRTCTickHandler(void)
{
    RTC_IntClear(RTC_IntGet());
}

#endif

#if (configUSE_TICKLESS_IDLE == 3)
void  xPortRTCTickHandler (void)
{
    uint32_t num;
    uint32_t count;

    RTC_IntClear(RTC_IF_COMP1);

    count = configRTC_GET_COUNT();

    num = RTCTICK_TO_OSTICK(count) + 1;
    count = OSTICK_TO_RTCTICK(num);

    configRTC_SET_COMPARE(count);


    /* If using preemption, also force a context switch. */
#if configUSE_PREEMPTION == 1
    portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;
#endif

    ( void ) portSET_INTERRUPT_MASK_FROM_ISR();
    {
        vTaskIncrementTick();
    }
    portCLEAR_INTERRUPT_MASK_FROM_ISR( 0 );
}
#endif
#if (configUSE_TICKLESS_IDLE == 4)
void  xPortRTCTickHandler (void)
{
    uint32_t ifc;

    ifc = RTC_IntGet();
    /* Clear interrupt source */
    if((ifc & RTC_IF_COMP0) != RTC_IF_COMP0)
    {
        RTC_IntClear(ifc);
        return;
    }
    RTC_IntClear(ifc);

    RTC_CounterReset();

    configRTC_SET_COMPARE(ulTimerReloadValueForOneTick);

    /* If using preemption, also force a context switch. */
#if configUSE_PREEMPTION == 1
    portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;
#endif

    ( void ) portSET_INTERRUPT_MASK_FROM_ISR();
    {
        vTaskIncrementTick();
    }
    portCLEAR_INTERRUPT_MASK_FROM_ISR( 0 );
}
#endif
